import React, { useState } from 'react';
import arrDown from '../../public/assets/icon/arrDown.png'
import til1 from '../../public/assets/photo/til1.png'
import til2 from '../../public/assets/photo/til2.png'
import './textiltext.scss';

const Textiltext = () => {
    const [isVisible, setIsVisible] = useState(false);

    const handleClick = () => {
        setIsVisible(!isVisible);

    };
    return (
        <>
            <section className='tiltext'>
                <div className="container">
                    <div className="tiltext__content">
                        <div className="tiltext__img">
                            <img src={til1} alt="" />
                        </div>
                        <p className="tiltext__description">Сейчас идет второй этап строительства, в рамках которого возведут помещения общей площадью в 36 тысячи квадратных метров.

                            Наша задача — дать вам возможность работать в удобных двухуровневых комплексах для ведения бизнеса:
                            1-й этаж - магазин
                            2-й этаж - склад</p>
                        <div className="tiltext__img">
                            <img src={til2} alt="" />
                        </div>
                    </div>
                </div>
            </section>
            <section className='blok about'>
                <div className="container">
                    <div className="about__top" onClick={handleClick}>
                        <p>
                            Площадь каждого двухуровневого комплекса составит 80 квадратных метров. <br /><br />

                            На первом этаже также расположится небольшой офис. В каждом помещении обязательным является наличие систем кондиционирования, противопожарной безопасности и всех канализационных сетей.

                        </p>
                        <img src={arrDown} alt="arr" />
                    </div>
                    <div className="about__content">
                        <div className={`text-container ${isVisible ? 'visible' : ''}`}>

                            Таким образом, резиденты и клиенты получат возможность оперативно найти материалы и фурнитуру необходимого качества и расцветки.
                            <br />
                            Процесс покупки и продажи будет проводиться в комфортных условиях.
                            Далее предусмотрен третий этап, на котором также будут возведены аналогичные складкие здания.
                            <br /> <br />
                            Здесь будет возведено всего 5 зданий каждое по 4 тысячи квадратных метров, из которых два будут отданы под склады. Такой план очень удобен и продуман с логистической точки зрения.

                            Резидентами торгового комплекса «Silk Way» являются следующие компании и бренды:
                            <br />
                            1) <br />
                            2) <br />
                            На сегодняшний день в продаже осталось 21 бутиков на 1 этаже. 36 бутиков на втором этаже.

Для получения подробной информации обращайтесь по следующим номерам: 
                                                        <div className="blok__btns">
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                            </div>

                        </div>
                    </div>
                </div>
            </section >
        </>
    )
}

export default Textiltext