import React, { useState } from 'react';
import { Swiper, SwiperSlide } from 'swiper/react';
import t1 from '../../public/assets/photo/t1.png'
import { Pagination, Navigation } from 'swiper/modules';
// Import Swiper styles
import 'swiper/css';
import 'swiper/css/pagination';
import 'swiper/css/navigation';
import arrDown from '../../public/assets/icon/arrDown.png'
import st1 from '../../public/assets/photo/st1.png'
import './strade.scss'
const Strade = () => {
    const [isVisible, setIsVisible] = useState(false);

    const handleClick = () => {
        setIsVisible(!isVisible);

    };
    return (
        <div className='strade'>
            <section className='about' >
                <div className="container">
                    <div className="about__top-wrap">
                        <h2 className="about__title">
                            ПРОМЫШЛЕННЫЙ КОМПЛЕКС
                            “SILK WAY”
                        </h2>
                    </div>
                    <div className="about__top">
                        <h2 className="about__title">
                            О комплексе
                        </h2>
                        <img onClick={handleClick} src={arrDown} alt="arr" />
                    </div>
                    <div className="about__content">
                        Промышленный комплекс будет играть одну из ключевых ролей в развитии экономики.
                        <br /><br />
                        Промышленный комплекс способствует привлечению инвестиций и созданию новых рабочих мест. Благодаря сосредоточению производственных мощностей в одном месте, комплекс обеспечит экономию времени и ресурсов на логистику и транспортировку.
                        <div className={`text-container ${isVisible ? 'visible' : ''}`}>

                            Традиционно промышленные комплексы способствуют развитию инноваций и технологическому прогрессу в различных отраслях промышленности. Другими словами, на одной площадке будут сконцентрированы, как производство материалов, так и конечного продукта.
                            <br /> <br />
                            Тем самым удастся избежать лишних расходов связанных с поиском товаров на различных рынках страны и доставкой. Далее промышленный комплекс предоставляет отличную возможность собрать единомышленников, чтобы совместно завоевывать зарубежные рынки.
                        </div>
                        <div className="about__imge">
                            <img src={st1} alt="about" />
                        </div>
                        <div className="about__content">
                            Еще один важный момент — промышленный комплекс помимо создания рабочих мест, будет большой упор делать на обучении, в частности курсы для швей и так далее.
                            <br /> <br />
                            Таким образом, резко вырастет профессиональный уровень отечественных работников.
                        </div>
                    </div>
                </div>
            </section >
            <section className='about'>
                <div className="container">

                    <div className="about__top">
                        <h2 className="about__title">
                            О промышленном комплексе «Silk Way» в цифрах:
                        </h2>
                        <img onClick={handleClick} src={arrDown} alt="arr" />
                    </div>
                    <div className="about__content">
                        Огромная площадь протяженностью 200 000 м2 предназначено для заводов и фабрик. <br /> <br />

                        Для удобства резидентов, клиентов и персонала будет возведено большая мечеть и будут создано большое пространство для парковки автомашин.
                        <br />
                        <div className={`text-container ${isVisible ? 'visible' : ''}`}>
                            <br />
                            На данном этапе завершено возведение индустриальных объектов общей площадью более 11 тысяч квадратных метров.
                            <br />
                            Кроме того, ведется строительство фабрик и заводов общей площадью в 40 тысяч квадратных метров.
                            <br />
                            В промышленном комплексе нет требования по производству только определенного вида товаров. <br /> <br /> Можно возводить предприятия по выпуску различных видов продукции: одежды, стройматериалы, как пенобетон, газобетон и так далее.
                            <br />

                        </div>

                    </div>
                </div>
            </section>
            <section className='projects'>
                <div className="container">
                    <div className="projects__wrap">

                        <div className="projects__content">
                            <div className="projects__photo">
                                <Swiper
                                    pagination={{
                                        type: 'fraction',
                                    }}
                                    navigation={true}
                                    modules={[Pagination, Navigation]}
                                    className="mySwiper"
                                >
                                    <SwiperSlide>
                                        <img src={t1} alt="projects" />
                                    </SwiperSlide>
                                    <SwiperSlide>
                                        <img src={t1} alt="projects" /></SwiperSlide>
                                    <SwiperSlide>
                                        <img src={t1} alt="projects" /></SwiperSlide>
                                    <SwiperSlide>
                                        <img src={t1} alt="projects" /></SwiperSlide>
                                    <SwiperSlide>
                                        <img src={t1} alt="projects" /></SwiperSlide>
                                </Swiper>


                            </div>
                            <div className="projects__text">
                                <p className="projects__description">Резидентами промышленного комплекса «Silk Way» являются следующие компании и бренды:
                                    <br /> <br />  1) <br />
                                    2) <br /> <br />
                                     места выкуплены, остались последние 40 соток земли. 
                                    
Важно!!! Все участки под заводы и фабрики выдаются с красной книгой!
                                    
                                    бращайтесь по следующим номерам:
                                                                    </p>

                                <div className="blok__btns">
                                    <a href='tel:+996559225588 ' className="blok__btn">
                                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                        </svg>
                                        0 559 22 55 88
                                    </a>
                                    <a href='tel:+996559225588 ' className="blok__btn">
                                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                        </svg>
                                        0 559 22 55 88
                                    </a>
                                    <a href='tel:+996559225588 ' className="blok__btn">
                                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                        </svg>
                                        0 559 22 55 88
                                    </a>
                                    <a href='tel:+996559225588 ' className="blok__btn">
                                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                        </svg>
                                        0 559 22 55 88
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </section >
        </div>
    )
}

export default Strade