import React, { useState } from 'react';
import './about.scss'
import arrDown from '../../public/assets/icon/arrDown.png'
import { transform } from 'framer-motion';

const About = () => {
    const [isVisible, setIsVisible] = useState(false);

    const handleClick = () => {
        setIsVisible(!isVisible);
      
    };

    return (
        <section className='about'>
            <div className="container">
                <div className="about__top">
                    <h2 className="about__title">
                        О компании
                    </h2>
                    <img onClick={handleClick} src={arrDown} alt="arr"/>
                </div>
                <div className="about__content">
                    Впервые в Кыргызстане создан многопрофильный промышленно-торговый комплекс, в котором будут работать тысячи предпринимателей, а его продукция будет интересна многим отечественным и зарубежным бизнесменам и покупателям.
                    <div className={`text-container ${isVisible ? 'visible' : ''}`}>
                        Требование времени — создание высокотехнологичных и социально ориентированных индустриальных парков, которые будут на одной площадке объединять ряд промышленных кластеров.
                        Как в древности Великий шелковый путь связывал Восток с Западом, так и наш парк займет важное логистическое место в экономике евразийского региона. Для этого есть все основания, ведь мы являемся одним из масштабным торгово-промышленным комплексом на пространстве СНГ.
                        Индустриальный парк «SILK WAY» занимает 70 гектаров. Несмотря на огромную площадь, каждый квадратный метр использован рационально и с учетом потребностей клиентов.
                        Все сделано для комфорта, удобного ведения бизнеса и с использованием лучших логистических практик. Также мы опирались на мировой опыт по созданию различных кластеров и использовали его при проектировании и возведении индустриального парка.
                    </div>
                </div>
            </div>
        </section >
    )
}

export default About