import React, { useState } from 'react';
import arrDown from '../../public/assets/icon/arrDown.png'
import blok1 from '../../public/assets/photo/blok1.png'
import blok2 from '../../public/assets/photo/blok2.png'

import './block.scss'
const Blok = () => {
    const [isVisible, setIsVisible] = useState(false);

    const handleClick = () => {
        setIsVisible(!isVisible);

    };
    return (
        <>
            <section className="blok">
                <div className="container">
                    <div className="blok__content">
                        <div className="blok__text">
                            <p className="blok__description">
                                Однако это не предел, в планах возведение еще трех блоков. Давайте кратко расскажем о каждом из них.
                                <br /><br />
                                Блок 2 будет такой же, как и Блок 1, то есть двухэтажное здание, с 700 бутиками и 12 входами. Помимо прочего предусмотрен подвал под складские помещения.
                            </p>
                        </div>
                        <div className="blok__imge">
                            <img src={blok1} alt="block" />
                        </div>
                    </div>
                    <div className="blok__bottom">
                        <p className="blok__description">
                            Блок 3 будет состоять из 4 этажей, с общей площадью в 35 тысяч 200 квадратных метров.

                            На трех этажах будут расположены торговые бутики, а четвертый предназначен для проведения выставок-ярмарок, форумов, мастер-классов и показов мод.

                            Для ввоза и вывоза товара выделен нулевой этаж в целях логистики. <br /><br />

                            Блок 4 аналогичен блоку 2. На трех этажах будут расположены торговые бутики, а на четвертом медицинский центр и СПА-салон.

                            Здоровье - первое богатство и поэтому наша задача, чтобы здесь имелось лучшее медицинское оборудование и работали врачи которые могли в необходимый момент оказать помощь.
                        </p>
                    </div>
                    <div className="blok__bottom-imge">
                        <img src={blok2} alt="block" />
                    </div>
                </div>
            </section>




            <section className='blok about'>
                <div className="container">
                    <div className="about__top" onClick={handleClick}>
                        <p>
                            Торговый комплекс фактически является многоцелевым, где можно будет, как приобрести или продать товары, а также поучаствовать в важных мероприятиях, вкусно пообедать и даже немного расслабиться в СПА-центре или в свободное время заняться своим здоровьем.

                        </p>
                        <img src={arrDown} alt="arr" />
                    </div>
                    <div className="about__content">
                        <div className={`text-container ${isVisible ? 'visible' : ''}`}>
                            Администрация в свою очередь создала такие условия, что все это можно будет сделать комфортно.

                            Резидентами торгового комплекса «Silk Way» являются следующие компании и бренды:
                            <br />
                            1)
                            <br />
                            2)
                            <br />
                             осталось 21 бутиков на 1 этаже. 36 бутиков на втором этаже.
                            
                            Для получения подробной информации обращайтесь по следующим номерам:

                            <div className="blok__btns">
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                                <a href='tel:+996559225588 ' className="blok__btn">
                                    <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                                    </svg>
                                    0 559 22 55 88
                                </a>
                            </div>
                        
                        </div>
                     </div>
                </div>
            </section >
        </>
    )
}

export default Blok