import React, { useState } from 'react'
import arrDown from '../../public/assets/icon/arrDown.png'

const Residential = () => {
  const [isVisible, setIsVisible] = useState(false);

  const handleClick = () => {
    setIsVisible(!isVisible);

  };
  return (
    <main>
      <section className='blok about'>

        <div className="container">
          <div className="about__top-wrap">
            <h2 className="about__title">
              ЖИЛОЙ КОМПЛЕКС
              “SILK WAY”
            </h2>
          </div>
          <div className="about__top" onClick={handleClick}>
            <p>
              Основная цель строительства жилого комплекса на территории индустриального парка — создание благоприятных условий для сотрудников и резидентов.
              <br /><br />
              Проживая неподалеку от своего места работы, они сильно сократят время на дорогу и тем самым увеличит производительность труда.
              Это повысит привлекательность индустриального парка как места работы, что может привлечь квалифицированных специалистов и уменьшить текучесть кадров.
            </p>
            <img src={arrDown} alt="arr" />
          </div>
          <div className="about__content">
            <div className={`text-container ${isVisible ? 'visible' : ''}`}>
              В целом, строительство жилого комплекса в индустриальном парке со своей инфраструктурой может быть выгодным решением для улучшения условий проживания и работы сотрудников, а также для развития района как целостной территории.

              Под него выделено 150 тысяч квадратных метров. Фактически это будет городок с собственной социальной инфраструктурой.
              <br /> <br />
              Отметим, что стоимость жилплощади минимальная — от 500 долларов США за квадратный метр.
              <br />
              Наш приоритет — создать условия для каждого жильца.
              Поэтому предусмотрен спортивный комплекс, который включает в себя футбольное и волейбольное поля, теннисный корт и зону для активного отдыха. Также будет разбита аллея длиной до 1 км, любители прогулок по бульвару Эркиндик оценят.Еще одно преимущество на территории жилищного комплекса будет возведена мечеть с медресе. Важное примечание будут еще построены детский сад и гостиница 
              <br /><br />
Для вашего комфорта и удобства ваших гостей предусмотрено 600 парковочных мест. Также неподалеку находится конечная остановка общественного транспорта.
              <br />
              Обеспечение разнообразной инфраструктуры в жилом комплексе ощутимо улучшит качество жизни сотрудников и резидентов и их семей

              Для получения подробной информации обращайтесь по следующим номерам:
              <div className="blok__btns">
                              <a href='tel:+996559225588 ' className="blok__btn">
                  <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                  </svg>
                  0 559 22 55 88
                </a>
                <a href='tel:+996559225588 ' className="blok__btn">
                  <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                  </svg>
                  0 559 22 55 88
                </a>
                <a href='tel:+996559225588 ' className="blok__btn">
                  <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                  </svg>
                  0 559 22 55 88
                </a>
                <a href='tel:+996559225588 ' className="blok__btn">
                  <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9.03921 7.60415L8.73587 7.90615C8.73587 7.90615 8.01387 8.62348 6.04387 6.66482C4.07387 4.70615 4.79587 3.98882 4.79587 3.98882L4.98654 3.79815C5.45787 3.33015 5.50254 2.57815 5.09121 2.02882L4.25121 0.906816C3.74187 0.226816 2.75854 0.136816 2.17521 0.716816L1.12854 1.75682C0.839873 2.04482 0.646539 2.41682 0.669873 2.83015C0.729873 3.88815 1.20854 6.16348 3.87787 8.81815C6.70921 11.6328 9.36587 11.7448 10.4519 11.6435C10.7959 11.6115 11.0945 11.4368 11.3352 11.1968L12.2819 10.2555C12.9219 9.62015 12.7419 8.53015 11.9232 8.08548L10.6499 7.39282C10.1125 7.10148 9.45921 7.18682 9.03921 7.60415Z" fill="white" />
                  </svg>
                  0 559 22 55 88
                </a>
              </div>

            </div>
          </div>
        </div>
      </section >
    </main>
  )
}

export default Residential